# -------------------------------------------------- importゾーン --------------------------------------------------

import fontforge # 相変わらず「インポート "fontforge" を解決できませんでした」と言われる日々（？）

# -------------------------------------------------- ここにグリフをいじる機構をつくる予定、実装できるかは知らない！！！！！ --------------------------------------------------

def lakof_generator(font, weight):

    glyph = font.createChar(ord("a"), "a")
    pen = glyph.glyphPen()
    pen.moveTo((100, 100))
    pen.lineTo((200, 100))
    pen.lineTo((200, 200))
    pen.lineTo((100, 200))
    pen.closePath()